app/controllers/admin/admission_records_controller.rb

	def index
		@q = SearchParams.new(params[:search_params] || {})
    search_params = @q.attributes(self)
    @admission_records = AdmissionRecord.default_where(search_params).page(params[:page]).per(10)
---
SELECT  `admission_records`.* FROM `admission_records` ORDER BY `admission_records`.`id` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `admission_records`