app/controllers/admin/apply_sets_controller.rb

SELECT  `apply_sets`.* FROM `apply_sets` ORDER BY `apply_sets`.`id` DESC LIMIT 10 OFFSET 0
---
	def index
		@q = SearchParams.new(params[:search_params] || {})
    search_params = @q.attributes(self)
    @apply_sets = ApplySet.default_where(search_params).page(params[:page]).per(10)