app/controllers/admin/interview_scores_controller.rb

SELECT  `interview_scores`.* FROM `interview_scores` ORDER BY `interview_scores`.`id` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `interview_scores`
SELECT `students`.* FROM `students` WHERE `students`.`id` IN (35, 16) ORDER BY `students`.`id` DESC
---
	def index
		@q = SearchParams.new(params[:search_params] || {})
	    search_params = @q.attributes(self)
	    @interview_scores = InterviewScore.includes(:student).default_where(search_params).page(params[:page]).per(10)

SELECT `interview_scores`.* FROM `interview_scores` ORDER BY `interview_scores`.`id` DESC
---
	def export_interview_score
        search_date = Time.now
	    file = Spreadsheet.open "#{Rails.root}/public/xls/interview_scores.xls"
	    list = file.worksheet  0
	    interview_scores = InterviewScore.all