app/controllers/admin/student_documents_controller.rb

	def index
		@q = SearchParams.new(params[:search_params] || {})
    search_params = @q.attributes(self)
    @students = StudentDocument.default_where(search_params).page(params[:page]).per(10)
---
SELECT  `student_documents`.* FROM `student_documents` WHERE (student_documents.name like '%test1%') ORDER BY `student_documents`.`id` DESC LIMIT 10 OFFSET 0

  def test_student
    @q = SearchParams.new(params[:search_params] || {})
    search_params = @q.attributes(self)
    @students = StudentDocument.default_where(search_params).page(params[:page]).per(10)
---
SELECT  `student_documents`.* FROM `student_documents` WHERE (student_documents.name like '%test1%') ORDER BY `student_documents`.`id` DESC LIMIT 10 OFFSET 0

	def set_student
		@student = StudentDocument.find(params[:id])
---
SELECT  `student_documents`.* FROM `student_documents` WHERE `student_documents`.`id` = 2 ORDER BY `student_documents`.`id` DESC LIMIT 1