app/controllers/admin/students_controller.rb

	def index
		@q = SearchParams.new(params[:search_params] || {})
    search_params = @q.attributes(self)
    @students = Student.default_where(search_params).page(params[:page]).per(10)
---
SELECT  `students`.* FROM `students` WHERE (students.name like '%student147%') ORDER BY `students`.`id` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `students`

  def update
    @student.update(student_params)
---
UPDATE `students` SET `student_no` = '21312', `updated_at` = '2019-11-27 10:05:31' WHERE `students`.`id` = 147

  def export_student
    search_date = Time.now
    file = Spreadsheet.open "#{Rails.root}/public/xls/students.xls"
    list = file.worksheet  0
    students = Student.all
---
SELECT `students`.* FROM `students` ORDER BY `students`.`id` DESC

	def set_student
		@student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 147 ORDER BY `students`.`id` DESC LIMIT 1