app/controllers/admin/student_classes_controller.rb

SELECT  `student_classes`.* FROM `student_classes` WHERE (student_classes.name like '%平台%') ORDER BY `student_classes`.`id` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `student_classes`
---
	def index
		@q = SearchParams.new(params[:search_params] || {})
	    search_params = @q.attributes(self)
	    @student_classes = StudentClass.default_where(search_params).page(params[:page]).per(10)