app/controllers/admin/users_controller.rb

SELECT  `users`.* FROM `users` WHERE (users.email like '%107422244%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `users` WHERE (users.email like '%107422244%')
---
  def index
    @q = SearchParams.new(params[:search_params] || {})
    search_params = @q.attributes(self)
    @users = User.default_where(search_params).page(params[:page]).per(10)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` DESC LIMIT 1
---
	def set_user
		@user = User.find(params[:id])