app/controllers/admin/written_scores_controller.rb

SELECT  `written_scores`.* FROM `written_scores` ORDER BY `written_scores`.`id` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `written_scores`
---
	def index
		@q = SearchParams.new(params[:search_params] || {})
	    search_params = @q.attributes(self)
	    @written_scores = WrittenScore.includes(:student).default_where(search_params).order(id:"desc").page(params[:page]).per(10)

INSERT INTO `written_scores` (`student_id`, `score`, `score_order`, `status`, `created_at`, `updated_at`) VALUES (3, 78.33, 1, 1, '2016-10-29 01:20:32', '2016-10-29 01:20:32')
---
	def create_import_written_score
	  @import = { failed: []}
    @message = {color:"#ff0000"}
    unless params[:file].blank?
      orig_name = params[:file].original_filename
      if ".XLSX" == File.extname(orig_name).upcase
        require 'roo'
        @students = []
        path = params[:file].tempfile.path
        workbook = Roo::Spreadsheet.open path
        worksheet = workbook.sheet(0)
        row_no = 1
        worksheet.each_row_streaming(offset: 1, pad_cells: true) do |row|
          row_no += 1
          next if row[0].blank?
          record = {excel_row: row_no, success: true}
          WrittenScore::SCORE_COLUMNS.each do |c,i|
            record[c] = row[i]&.value
          end
          return_student, message = WrittenScore.save_from_hash(record, current_user)

SELECT `written_scores`.* FROM `written_scores` ORDER BY `written_scores`.`id` DESC
---
	def export_written_score
		search_date = Time.now
    file = Spreadsheet.open "#{Rails.root}/public/xls/interview_scores.xls"
    list = file.worksheet  0
    interview_scores = WrittenScore.all