app/controllers/admin/written_scores_controller.rb

SELECT  `written_scores`.* FROM `written_scores` LIMIT 10 OFFSET 0
---
	def index
		@q = SearchParams.new(params[:search_params] || {})
	    search_params = @q.attributes(self)
	    @written_scores = WrittenScore.default_where(search_params).page(params[:page]).per(10)