app/controllers/admin/written_applies_controller.rb

SELECT  `written_applies`.* FROM `written_applies` ORDER BY `written_applies`.`id` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `written_applies`
SELECT `apply_sets`.* FROM `apply_sets` WHERE `apply_sets`.`id` IN (1, 2) ORDER BY `apply_sets`.`id` DESC
SELECT `students`.* FROM `students` WHERE `students`.`id` IN (19, 21, 22, 1) ORDER BY `students`.`id` DESC
---
	def index
		@q = SearchParams.new(params[:search_params] || {})
    search_params = @q.attributes(self)
    @written_applies = WrittenApply.includes(:apply_set,:student).default_where(search_params).page(params[:page]).per(10)

SELECT `written_applies`.* FROM `written_applies` ORDER BY `written_applies`.`id` DESC
---
  def export_written_apply
    search_date = Time.now
    file = Spreadsheet.open "#{Rails.root}/public/xls/written_applies.xls"
    list = file.worksheet  0
    written_apply = WrittenApply.all

SELECT  `written_applies`.* FROM `written_applies` WHERE `written_applies`.`id` = 4 ORDER BY `written_applies`.`id` DESC LIMIT 1
---
	def set_written_apply
		@written_apply = WrittenApply.find(params[:id])