app/controllers/web/written_applies_controller.rb

	def index
	   @student = current_user.student
	   @written_applies = WrittenApply.preload(:student).default_where(student_id:@student.id)
     redirect_to :action=>"new" unless @written_applies.size>0
---
SELECT  `written_applies`.* FROM `written_applies` WHERE `written_applies`.`student_id` = 1 ORDER BY `written_applies`.`id` DESC LIMIT 1
SELECT COUNT(*) FROM `written_applies` WHERE `written_applies`.`student_id` = 1